In [1]:
import pandas as pd
df = pd.read_csv("data.csv")
df.head()

   Roll No.          Name  Branch   Cgpa
0         1         Mohit     Cse    7.0
1         2        Mahith     Cse    9.0
2         3   Guna Sekhar            8.0
3         4        Lokesh            8.5

In [2]:
df.tail(2)

   Roll No.          Name  Branch   Cgpa
2         3   Guna Sekhar            8.0
3         4        Lokesh            8.5

In [3]:
df.describe()

       Roll No.      Cgpa
count  4.000000  4.000000
mean   2.500000  8.125000
std    1.290994  0.853913
min    1.000000  7.000000
25%    1.750000  7.750000
50%    2.500000  8.250000
75%    3.250000  8.625000
max    4.000000  9.000000

In [4]:
df = pd.read_excel("Book.xlsx")
df.head()

   Roll         Name Branch  Cgpa
0     1        Mohit    CSE     7
1     2  Guna Sekhar    CSE     8
2     3       Mahith    CSE     9

In [5]:
df.tail()

   Roll         Name Branch  Cgpa
0     1        Mohit    CSE     7
1     2  Guna Sekhar    CSE     8
2     3       Mahith    CSE     9

In [6]:
df.describe()

       Roll  Cgpa
count   3.0   3.0
mean    2.0   8.0
std     1.0   1.0
min     1.0   7.0
25%     1.5   7.5
50%     2.0   8.0
75%     2.5   8.5
max     3.0   9.0

In [7]:
d = pd.read_json("students.json")
d.head()

                                    students
0    {'Name': 'Mohit', 'Roll': '21131a05a4'}
1   {'Name': 'Mahith', 'Roll': '21131a0581'}
2  {'Name': 'Gowtham', 'Roll': '21131a05d2'}
3   {'Name': 'Lokesh', 'Roll': '21131a0587'}

In [8]:
d.tail()

                                    students
0    {'Name': 'Mohit', 'Roll': '21131a05a4'}
1   {'Name': 'Mahith', 'Roll': '21131a0581'}
2  {'Name': 'Gowtham', 'Roll': '21131a05d2'}
3   {'Name': 'Lokesh', 'Roll': '21131a0587'}

In [9]:
d.describe()

                                       students
count                                         4
unique                                        4
top     {'Name': 'Mohit', 'Roll': '21131a05a4'}
freq                                          1

In [10]:
text = open("ML.txt")
d3 = text.read()
d3

'Machine Learning is the field of study that gives computers the capability to learn\nwithout being explicitly programmed. ML is one of the most exciting technologies \n\nthat one has ever come across. As it is evident from the name, it gives the computer \nsomething that makes it more  similar to humans: The ability to learn. Machine learning \nis actively being used today, perhaps in many more places than one would expect.'

In [11]:
import zipfile
data=zipfile.ZipFile("sample.txt.zip",'r')
data1=data.read("sample.txt")
data1

b'Python has a crucial role in machine learning because Python provides libraries like NumPy, \nPandas, Scikit-learn, TensorFlow, and Keras. These libraries offer tools and functions essential \nfor data manipulation, analysis, and building machine learning models. It is well-known for its \nreadability and offers platform independence. These all things make it the perfect language of \nchoice for Machine Learning.'